import pandas as pd

print('-'*60)
print('Реестр кабинета')

cabinet_card = {
        'Предмет': ['Русский язык','Математика','Физика','Химия','Информатика'],
        'Вариант' : ['1','2','3','4','5'],
        'Ряд': ['Первый ряд','Второй ряд', 'Третий ряд', 'Четвертый ряд', 'Пятый ряд'],
        'Вид парты' : ['Одноместная','Одноместная','Одноместная','Одноместная','Одноместная'],
        'ID' : ['01','02','03','04','05']
}
    
cc = pd.DataFrame(data = cabinet_card)

with open('cabinet.csv', 'a', encoding='UTF-8') as file:
        file.write(f'{cc}')
        file.write('\n')
    
print(cc)