import pandas as pd

print('-'*60)
print('Табель учащихся школы')

stud_card = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Ксения','Дмитрий','Анжела','Петр','Елена'],
        'Фамилия': ['Глушкова','Матвеев','Дема','Кузнецов','Медведева'],
        'Дата рождения' : ['16.01.2010','31.10.2010','01.05.2010','05.08.2010','28.03.2010'],
        'Успеваемость' : ['Отличник','Троечник','Хорошист','Хорошист','Отличник']
}

sc = pd.DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as file:
        file.write(f'{sc}')
        file.write('\n')
    
print(file)